[
  {
    "content": "Key Takeaways A broad 10 tariff on goods imports, with a 60 tariff on Chinese imports, would raise 2.6 trillion over the next decade0.7 of GDPif other countries did not retaliate against the US. If targeted countries retaliate, however, as is likely the case, tariff revenue falls by 12-26 depending on the scenario. The level of consumer prices would rise by 1.4 to 5.1 before substitution, between a tenth and a third of the first four years of pandemic inflation.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 466,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This cost is the equivalent of 1,900 to 7,600 per household in 2023 dollars. Partial dynamic analysis suggests the tariff proposals analyzed here could lower the level of US real GDP by 0.5 to 1.4, which would shave roughly 400 billion to 1 trillion off of revenue estimates. Tariff revenue as a percent of GDP would rise to levels unseen since at least World War I and possibly since the 1870s. Effective tariff rates would be 6-27 p.p.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 1,
    "start_pos": 76,
    "end_pos": 514,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "p. higher after substitution, bringing average tariffs to at least World War II levels. At several points over the course of the 2024 campaign, former President Trump has put forward a variety of different proposals for broadly raising tariffs across the board. A tariff is a tax on imports, generally levied at an ad valorem rate on the imports customs value.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 2,
    "start_pos": 160,
    "end_pos": 520,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Americans purchase imports directly as a part of final demandsuch as when a consumer buys imported clothing at a retailer, or a business buys imported softwareor as an input into the domestic production process, such as when a domestic auto manufacturer imports a key part. Tariffs, therefore, carry the potential to affect many different layers of the economy. Like all tax policy, tariffs involve trade-offs, and they have both fiscal and macroeconomic implications.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 3,
    "start_pos": 433,
    "end_pos": 902,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Unlike narrow, targeted tariffs, the broad tariffs of the magnitude proposed by President Trump have the potential to raise meaningful revenue over the budget window. However, these effects are uncertain and sensitive to key assumptions about the behavior of both US and foreign consumers, businesses, and governments. President Trumps proposals have also sparked a public debate about who bears the ultimate burden, or theincidence, of tariffs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 4,
    "start_pos": 599,
    "end_pos": 1045,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This question is neither new nor broadly open in the forum of public finance and trade economics, however. A consistent theoretical andempirical finding in economicsis thatdomestic consumersand domestic firms bear the burden of a tariff, not the foreign country.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 5,
    "start_pos": 705,
    "end_pos": 968,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This analysis purpose, therefore, is not to re-adjudicate the incidence question1but to instead, from the standpoint of economic evidence, quantify the fiscal and macroeconomic effects of illustrative tariff proposals that capture the elements of various comments from President Trump. The Budget Lab (TBL) modeled 12 proposals that differ in their tariff rates on various countries and whether those countries retaliate against the US with their own counter-tariffs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 6,
    "start_pos": 990,
    "end_pos": 1458,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL employed a widely-used global trade model to help measure the effects of these proposals on US and foreign trade flows, on US tax revenues, and on US consumer prices. Summary Table 1 shows TBLs main findings: The tariff proposals TBL modeled raise between 1.2 to 4.4 trillion over 10 years under conventional assumptions, or 0.3 to 1.2 of average GDP.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 7,
    "start_pos": 1160,
    "end_pos": 1516,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "2 of average GDP. When other countries retaliate against US tariffs, that lowers US tariff revenue relative to the same proposal under a no-retaliation scenario by 12-26. TBL calculated that these tariffs also initially raise the level of consumer prices by 1.2 to 5.1. To put this in perspective, this represents 7 to 31 months of normal inflation under the Federal Reserves target, and between a tenth and a third of the price level increase experienced over 2020-2023.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 8,
    "start_pos": 1312,
    "end_pos": 1783,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The loss in average disposable income from these price increases would be the equivalent of 1,900 to 7,600 per household in 2023 dollars (the final price increase and loss to household purchasing power would depend on, among other things, the extent of substitution away from tariffed goods and the Federal Reserves reaction to the tariff-driven price shock). Effective (that is, weighted-average) tariff rates are 13 to 52 percentage points higher before substitution.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 9,
    "start_pos": 1671,
    "end_pos": 2141,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Even after US consumers and businesses substitute towards domestic or lower-tariffed-imported options, effective tariff rates are 6 to 27 percentage points higher, raising the overall effective tariff rate to levels at least unseen since World War II and possibly since 1899.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 10,
    "start_pos": 1946,
    "end_pos": 2222,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Finally, while TBL performed most of its analysis under a conventional assumption of fixed US aggregate economic activity, we also present some partial estimates of dynamic effects on the size of US economy from the various tariff proposals. In the medium-term, real US GDP contracts by between -0.5 to -1.4. Under standard Congressional Budget Office (CBO) rules of thumb, these partial GDP effects imply tariff revenue would be smaller by an additional 400 billion to 1 trillion over 10 years.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 11,
    "start_pos": 2187,
    "end_pos": 2683,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Incommentsmade in January and February, President Trump indicated that he was considering a broad tariff on all imports of 10, withan additional 50 tariff on Chinese imports(bringing the maximum up to 60).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 12,
    "start_pos": 2392,
    "end_pos": 2598,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Inmore recent remarksin August, Trump said his broad tariff proposal could reach between 10 and 20 percent, raising the possibility that it would be even higher for some countries.Remarks in Septembersuggested President Trump was also contemplating a 200 tariff on certain imports from Mexico, especially if US firms relocate there. These comments formed the basis of the rates TBL used in its various scenario.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 13,
    "start_pos": 2724,
    "end_pos": 3136,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "These scenarios differed along three different dimensions: 3 possibilities Would the tariffs apply to all countries, would Mexico see a special 200 rate, or would tariffs exempt the current twenty countries with which the US has a comprehensive free trade agreement (FTA);2 2 possibilities Would non-China tariffs be set at 10 or 20; and, 2 possibilities Would other countries retaliate with their own equivalent tariffs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 14,
    "start_pos": 3145,
    "end_pos": 3567,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "For simplicity and neutrality, in TBLs modeling retaliation meant that any country targeted by a US tariff responded immediately by levying a tariff of the same rate on the same good when imported from the US.3 These three dimensions led to twelve different scenarios. Table 3 below summarizes the tariff parameters of each scenario.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 15,
    "start_pos": 3413,
    "end_pos": 3747,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "In this context, TBL assumed retaliation by other countries would beimmediate(meaning, other countries would impose their retaliatory tariffs in 2025, the same year as US tariffs) andtit-for-tat(each country would impose exactly the same tariff rate on exactly the same goods that the US did. E.g.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 16,
    "start_pos": 3705,
    "end_pos": 4003,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "E.g. in the 1060 scenario with retaliation, the US slaps a 10 broad tariff on all goods imports from Canada, so Canada retaliates immediately in our simulations with a tit-for-tat 10 tariff on all goods imports from the US). The most important modeling tool TBL incorporated into its analysis was a global trade model. In response to higher tariffs, US consumers and businesses purchase fewer imports, andor shift to purchasing imports from countries with lower tariffs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 17,
    "start_pos": 3924,
    "end_pos": 4394,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This behavior is crucial to consider when scoring a tariff proposal, since it bears on the effective tariff rate and the effective tariff base.4TBL employed a widely-used model in trade economics called the Global Trade Analysis Project (GTAP).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 18,
    "start_pos": 4168,
    "end_pos": 4413,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "GTAP contains data on bilateral trade relationships and domestic demand for 65 different categories of commodities across 160 different countries: GTAP has the ability to simulate how trade and economic activity shifts in the medium-to-long-term in the face of a persistent shock, such as a tariff imposed by one country on another countrys imports.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 19,
    "start_pos": 4517,
    "end_pos": 4867,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "To show why trade modeling is so important in this exercise, note first the US imported 3.1 trillion worth of goods in 2023, of which China made up 14 while the rest of the world made up 86. Lets say we were estimating the tariff revenue from a broad 10 tariff and a 60 tariff on China (without any retaliation, for simplicity).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 20,
    "start_pos": 4707,
    "end_pos": 5036,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "If we did not account for shifts in both the amount and composition of trade, we would estimate that this proposal would have raised about 530 billion in 2023 (3.1 trillion  (1460)  (8610)). But this would be a significant overestimate. First, in reality aggregate imports would decline under this proposal, so the import base would be smaller than 3.1 trillion. GTAP suggests that under this scenario, in equilibrium, imports fall by around 13, to the equivalent of less than 2.7 trillion in 2023.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 21,
    "start_pos": 4897,
    "end_pos": 5396,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "7 trillion in 2023. Second, even among consumers and businesses that still purchase imports, they purchase far fewer imports from China than before, since the relative price of Chinese imports are now far higher. GTAP suggests that trade with China virtually disappears under these tariffs, with the China share of goods imports shrinking to 3 from 14.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 22,
    "start_pos": 5089,
    "end_pos": 5441,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "That means the gross revenue raised from this proposal should be closer to 300 billion in 2023 (2.7 trillion  (360)  (9710)), or 40 less.5 More details on TBLs methodology are described in the Methodological Appendix. In addition to GTAP, TBL used CBOs baseline economic and fiscal projections and rules of thumb to estimate each scenarios fiscal effects.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 23,
    "start_pos": 5306,
    "end_pos": 5662,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL also used data from the Bureau of Economic Analysis (BEA) to estimate price level effects for the personal consumption expenditures (PCE) price index. TBL assumed that the tariffs in each proposal applied to all imported goods, including energy goods, but not imported services. Consistent with conventional budget scoring assumptions, TBL assumed that US aggregate economic activity remained fixed.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 24,
    "start_pos": 5460,
    "end_pos": 5864,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL relaxed these conventional assumptions to allow foreign economic activity to change in the face of US and retaliatory tariffs; this was necessary to capture the effects of retaliation on tariff revenues. TBL assumed that the Federal Reserve would look through (not react to) any one-time price level shift resulting from the tariffs. The results are summarized in Table 3 below.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 25,
    "start_pos": 5667,
    "end_pos": 6050,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The main takeaway is that TBLs retaliation assumptions substantially reduce tariff revenue for the US, by anywhere from 12-26 against their equivalent no-retaliation scenarios. For example, under a scenario where the US levies a broad 10 tariff and a 60 tariff against China, without retaliation the expected revenue raised would be about 2.6 trillion over 10 years, or 0.7 of GDP.1With retaliation, however, this falls by 16 to only 2.2 trillion over 10 years, 0.6 of GDP.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 26,
    "start_pos": 5843,
    "end_pos": 6317,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "6 of GDP. The retaliation effect gets larger with larger policies: a 20 tariff with a 60 China tariff raises 4.4 trillion over a decade without retaliation, but almost a quarter less1 trillionwith retaliation. Another take-away is that revenues are not linear with the broad tariff rate: doubling the non-China tariff does not double revenues.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 27,
    "start_pos": 6042,
    "end_pos": 6385,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This is not surprising: first, even on a static basis, one would expect the China tariff rate to also have to double for revenues to double, and second, some of the resulting country-commodity tariff increases might fall to the right of the Laffer Curve (i.e., imports fall by more than the rate increase, resulting in net lower revenue).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 28,
    "start_pos": 6380,
    "end_pos": 6719,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The proposed tariff against Mexico appears particularly harmful: the 2060200 scenarios actually raise slightlylessrevenue than the 2060 scenarios where Mexicos tariff is set to 20. Finally, if the proposal were pared down to avoid running afoul of current US free trade agreements by excluding the 20 FTA partners, it would cut revenues further by half. With TBLs retaliation assumptions, revenues are 1.2 trillion at a 10 broad rate and 1.7 trillion at a 20 rate.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 29,
    "start_pos": 6560,
    "end_pos": 7025,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBLs relaxed conventional score likely overestimates the amount of revenue raised from these tariff proposals, because it only accounts for limited dynamic channels in foreign countries and none in the US.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 30,
    "start_pos": 6765,
    "end_pos": 6971,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "A full dynamic fiscal score of the different tariff options that incorporates US macroeconomic feedback effects would account for many other short- and long-term factors, and their effects on revenue and spending, including: The reaction of the Federal Reserve.Evidence suggests that tariffs are substantially borne by consumers and businesses in the form of higher prices.7In response to new tariffs, the Federal Reserve may choose to look through (ignore) the one-time price level shock that results and leave the stance of monetary policy otherwise unchanged.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 31,
    "start_pos": 7327,
    "end_pos": 7890,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "It may, however, choose to offset the price level rise by temporarily tightening policy until consumer prices return to some counterfactual level, especially if it sees the tariffs as affecting inflation expectations. Shifts in production and investment.Under a higher tariff regime, the US would have less ability to specialize in comparative advantage industries.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 32,
    "start_pos": 7544,
    "end_pos": 7910,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Greater autarky would instead mean some investment and production would shift towards goods and services previously imported, areas where the US is likely less productive. This would lower US real output and income over time. Interactions of foreign and domestic demand.Interacting with this dynamic too would be the fact that US tariffs would make America a less willing customer for foreign goods, curbing foreign GDP over time.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 33,
    "start_pos": 7715,
    "end_pos": 8146,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "If foreign countries retaliated against the US with their own tariffs, then US exporters would lose key foreign customers. The resulting global trade war could persistently lower global output. The effects of each proposal on the medium-run level of US real GDP in GTAP are shown in Table 4. The medium-term fall in real GDP ranges from 0.5 to 1.43 depending on the scenario. That would be the equivalent of a loss of 145 billion to 415 billion in output in 2024 Q2 dollars.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 34,
    "start_pos": 7837,
    "end_pos": 8312,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The standard GTAP model TBL used for the trade analysis does not fully account for all of the macroeconomic channels mentioned above. For example, GTAP is not an intertemporal model and does not account for the full set of US macroeconomic interactions of a large model such as FRBUS, which is the modelTBL used in its dynamic analysis of extending the Tax Cuts and Jobs Act (TCJA)(for example, the GTAP model lacks a central bank).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 35,
    "start_pos": 7970,
    "end_pos": 8403,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "But FRBUS is a domestic US model and inappropriate for trade analysis, and GTAPs real GDP estimates give at least a partial sense of the dynamic effects on revenue, such as some shifts in investment towards lower-comparative-advantage industries and some interactions of foreign and domestic demand.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 36,
    "start_pos": 8269,
    "end_pos": 8569,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL paired these results withstandard CBO rules-of-thumbabout the relationship between output and revenues.8These additional 10-year dynamic revenue effects are reported in the final column of Table 3. For example, TBL finds that the level of US real GDP is persistently 0.5 smaller under a 1060 tariff scenario with no retaliation.9Using conventional CBO elasticities, a 0.5 fall in the level of GDP would lower revenues by an additional 366 billion over 10 years.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 37,
    "start_pos": 8470,
    "end_pos": 8936,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The largest effect comes from a 2060200 tariff scenario with retaliation, lowering the level of real GDP by 1.43 in equilibrium. This implies 10-year revenues would be lower by roughly 1 trillion.10 An increase in tariffs raises the prices faced by domestic consumers and businesses.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 38,
    "start_pos": 8598,
    "end_pos": 8882,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL calculated how much each scenario would affect the level of the price index for Personal Consumption Expenditures (PCE) in equilibrium, assuming that the Federal Reserve did not counteract the price effect with tighter monetary policy, as well as what the effective (weighted average) tariff rate would be.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 39,
    "start_pos": 8908,
    "end_pos": 9219,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL calculated the price effect and effective tariff rate two ways:pre-substitution, which assumes unchanged 2023 import shares of consumption and trade shares across countries, andpost-substitution, which uses the GTAP simulation results to show how the effective price level and tariff rate changes after consumers substitute away from tariffed imports. These two approaches serve different purposes.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 40,
    "start_pos": 9263,
    "end_pos": 9666,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The pre-substitution measure is the better measure for thinking about the full welfare loss of each policy: the post-substitution measure understates this since it partially reflects consumers making potentially suboptimal choices as a way to mitigate costs. The post-substitution measure is the better measure to use in historical comparisons, since in the reality of actual history, past consumers made these choices, which are already reflected in the historical data.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 41,
    "start_pos": 9521,
    "end_pos": 9993,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL used input-output matrix data from the Bureau of Economic Analysis (BEA) to estimate these effects, and made assumptions to account for exchange rate effects and the prices of domestic substitutes; more details on the calculations are in the Methodological Appendix. The results in Table 5 show that the proposals imply price level effects ranging from 1.4 to 5.1 pre-substitution, with effective tariff rates ranging from 14-52.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 42,
    "start_pos": 9791,
    "end_pos": 10225,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "That implies that for every 1 percentage point effective pre-substitution tariff rate, the PCE price level rises by roughly 0.1 in equilibrium. So, for example, unsurprisingly the scenario with the lowest pre-substitution effective tariff rate is the 1060 scenario that exempts FTA partners (This would still however imply a 13 effective tariff rate over and above the current 2.5  effective customs duty; the last time the overall tariff was so high was the mid-1930s).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 43,
    "start_pos": 9934,
    "end_pos": 10405,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "That 12 pre-substitution additional effective tariff rate translates into a PCE price level that is 1.2 higher. To put this pre-substitution price level effect in perspective, this 1.2-5.1 range represents 7 to 31 months of normal inflation under the Federal Reserves 2 target. It is also the equivalent of between a tenth and a third of the price level increase experienced over 2020-2023.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 44,
    "start_pos": 10045,
    "end_pos": 10436,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Table 4 also presents the welfare loss from the pre-substitution price increase a different way: in terms of its equivalent effect on average disposable income per household in 2023 dollars.11The tariff proposals modeled here would cost the average US household the equivalent of between 1,900 and 7,600 in 2023; this accounts for both direct tariff revenue as well as higher prices from domestic producers who take advantage of tariff protectionism.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 45,
    "start_pos": 10495,
    "end_pos": 10946,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "It also accounts for the effect of the stronger US dollar under unilateral tariff scenarios, which in those cases mitigates the price and income effects slightly by making imports cheaper for US consumers. Post-substitution, price effects range from 0.5 to 2.0, with effective tariffs 6 to 27 percentage points higher. As mentioned earlier, these post-substitution results understate the true magnitude of each proposals welfare loss, since they reflect consumer substitution.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 46,
    "start_pos": 10700,
    "end_pos": 11177,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Even with substitution, these price effects and effective tariff rates are still substantial. Again, take the 1060 scenario that exempts FTA partners. US imports fall 9 overall, but imports from Canada, Mexico, and other FTA partners like Australia and Korea actually grow, and their collective share of US imports increases from 36 to 48, which makes sense since those countries see no tariff hikes. Meanwhile, Chinas share of US imports collapses from 14 to less than 3.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 47,
    "start_pos": 10793,
    "end_pos": 11266,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "So relative to the initial state, trade shares with Canada and Mexico (who have tariff rates of 0 under the proposal) grow, while they fall for China and the rest of the non-FTA world. The final post-substitution effective tariff rate is 6.6, just below half of the pre-substitution rate, while the post-substitution PCE price effect of 0.6, almost exactly half the pre-substitution effect.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 48,
    "start_pos": 10977,
    "end_pos": 11368,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The most extreme scenarioa 20 broad tariff with a 60 tariff on China and a 200 tariff on Mexico, all with retaliationis illustrative too. Imports into the US fall by a staggering 43, and imported goods go from making up 26 of goods consumption to about 16. Of this much reduced trade, China and Mexico become tiny shares, 3-4 each, while Canada grows to a quarter.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 49,
    "start_pos": 11114,
    "end_pos": 11479,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "By limiting their exposure, then, consumers manage to soften the blow of the tariffs by about half on the price and effective rate side. In interpreting these post-substitution results, recall two characteristics of TBLs modeling. First, the welfare effects to household are best judged pre-substitution. In the case of the 1060 scenario exempting FTA partners, that means a 1.2 pre-substitution price level increase, the equivalent of 1,900 per household in 2023.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 50,
    "start_pos": 11250,
    "end_pos": 11715,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Second, all of these simulations are conventional from the US perspectivethat is, they assume fixed US economic activity by design. The partial dynamic results presented in Table 3 suggest that in reality, these proposals would reduce US output; in the case of even the smallest 1060 tariff exempting FTA partners, US real GDP is still 0.5 smaller in equilibrium.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 51,
    "start_pos": 11381,
    "end_pos": 11745,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL put its results into the context of American history three ways: tariffs as a share of all federal revenues, tariff revenues as a percent of GDP, and the weighted average effective tariff rate. Tariffs are not an important source of federal revenues anymore. In fiscal year 2023, the United States collected roughly 80 billion in net customs duties.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 52,
    "start_pos": 11578,
    "end_pos": 11932,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "On the one hand, in current dollars, this was the second highest amount ever collected by the federal government, only surpassed by the year prior, FY2022. However, customs duties remain a tiny part of the federal budget: less than 2 of federal revenues in FY2023. This was not always the case. In the early days of the republic, tariffs regularly made up between 80-100 of federal revenues.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 53,
    "start_pos": 11733,
    "end_pos": 12125,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The Civil War brought about a temporary income tax and a more persistent shift towards internal excise taxes, but even then, customs duties made up about half of federal revenues until the early 20thcentury. After the enactment of the Sixteenth Amendment permanently legalized the income tax, however, and the subsequent entry of the U.S. into World War I, Congress enacted a series of measures raising income taxes and lowering tariffs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 54,
    "start_pos": 11940,
    "end_pos": 12378,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Customs duties saw one last period of favor in the 1920s and 30s, most famously with the Smoot-Hawley Tariff Act, but were an insignificant source of revenue by World War II. The last time tariff receipts exceeded 5 of federal revenues was 1940, as shown in Figure 1. The proposals analyzed in this report would raise between 1.6 trillion and 5.7 trillion in gross tariff revenue over 10 years on a conventional basis.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 55,
    "start_pos": 12114,
    "end_pos": 12533,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Projecting the share of federal revenues from tariffs that results from this depends on the crucial and highly uncertain assumption of the trajectory of other federal revenues.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 56,
    "start_pos": 12290,
    "end_pos": 12467,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Under an assumption that other revenues remained at levels consistent with current CBO projections, the tariff proposals analyzed in this report would raise the share of federal revenues from customs duties to a range of 4.2 to 10.5, shares not seen since 1941 and 1933, respectively.12 A different way of measuring tariff revenue is as a percent of GDP, shown below in Figure 2.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 57,
    "start_pos": 12669,
    "end_pos": 13049,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "In 2023, tariff revenue was less than one-third of 1 of GDP; at its peaks just after the Civil War and in the early 1800s, it reached about 2.5  of GDP. The range is less stark over time than when looking at tariffs as a share of revenue because the federal government in the past was both smaller relative to the economy and more dependent on customs duties in the 19thcentury than it is now.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 58,
    "start_pos": 12821,
    "end_pos": 13215,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "That also means that the proposals analyzed in this report are more historically extraordinary when looked at through the lens of revenue-to-GDP rather than share-of-federal-revenue: they would raise tariff revenue to between 0.7 and 1.9 of GDP. The last time US customs revenue was this high relative the economy was 1914 and 1873 respectively. A final way to think about tariffs is the weighted average effective tariff rate on all US goods imports (see Figure 3).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 59,
    "start_pos": 13066,
    "end_pos": 13533,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This came to 2.5 in 2023, lower than 2022s 3.0 and low relative to the totality of US history, but higher than the low effective rates reached in the 2000s and most of the 2010s. Note that it has been some time since effective tariff rates were significantly higher. The last time the weighted average tariff rate exceeded 10 was 1943; the last time it exceeded 20 was 1911. As mentioned earlier, the post-substitution effective tariff rate is the appropriate measure for historical analysis.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 60,
    "start_pos": 13244,
    "end_pos": 13737,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The proposals analyzed here would add an additional 6 to 27 percentage point to the weighted average effective tariff rate on top of the current 2.5, bringing the new total to roughly 8.9 to 29.5. The last time the effective tariff rate was this high was 1946 to 1899, respectively.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 61,
    "start_pos": 13440,
    "end_pos": 13723,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The reason why this historical range differs from the tariff-revenue-to-GDP historical range is because the effective tariff rate does not account for the aggregate amount of US imports the way tariff revenue-to-GDP does. Put another way: the US is more import-dependent now than it was a century ago, so would likely be able to raise early-1900s levels of tariff revenue with lower mid-1900s effective tariff rates.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 62,
    "start_pos": 13661,
    "end_pos": 14078,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "A conventional fiscal analysis assumes fixed aggregate macroeconomic activity, including consumption, investment, and exports. In the case of tariffswithoutretaliation, this principle means global GDP is fixed, but it still allows for certain behavioral shifts, such as between purchases of imported and domestic goods and services, or between imports of different countries of origin.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 63,
    "start_pos": 13787,
    "end_pos": 14173,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "These shifts affect the volume and value of imports and their composition, which in turn determines the final effective average tariff rate and ultimate tariff revenue raised.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 64,
    "start_pos": 13962,
    "end_pos": 14138,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Conventional scores also still account for the fact that tariffs, as an indirect tax, drive a wedge between the price consumers and firms pay for a good and the income firms receive for it, leaving them less income to pay capital and labor.13Lower income to these factors of production means lower income and payroll tax revenue, partially offsetting the tariff revenue raised. In reality, though, foreign countries would likely retaliate against US tariffs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 65,
    "start_pos": 14339,
    "end_pos": 14798,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Retaliation reduces the USs tariff revenue take-up for a number of reasons. For example, foreign capacity and income would contract post-retaliation. This shrinks foreign production capacity and potentially reduces the supply of exports to the US.14These channels are immaterial under strict conventional assumptions, however. If economic activity is held constant, then retaliation should not meaningfully change US tariff revenue.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 66,
    "start_pos": 14414,
    "end_pos": 14847,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The challenge is how to estimate the effects of foreign retaliation on US tariff revenue in the spirit of a conventional score but while also allowing enough modeling flexibility for limited shifts in foreign economic activity sufficient so that an effect on US tariff revenue from retaliation may be captured.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 67,
    "start_pos": 14724,
    "end_pos": 15035,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL developed arelaxed conventionalapproach that, in the face of US tariffs and retaliatory tariffs, 1) allows economic activity to change for the rest of the world butnotthe US, and 2) only incorporates these global non-US shifts into estimates of the effects of US tariff revenue, not of other US revenue sources. We use this relaxed conventional approach for all scenarios with or without retaliation in this analysis to make them comparable.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 68,
    "start_pos": 15039,
    "end_pos": 15485,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Why not simply estimate a full dynamic score of different tariff proposals? TBL was not confident that any single model or combination of models that TBL studied captured all of the macroeconomic dynamics for both the US and the rest of the world that TBL would want in a full dynamic score. TBL also felt there was value in scoring exercises hewing to conventional principles that would make the analysis comparable that produced by other scorekeepers and organizations.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 69,
    "start_pos": 15114,
    "end_pos": 15586,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Global dynamic trade and macroeconomic analysis is an area ripe for future research and investment by TBL. To account for global trade adjustments in the face of different tariff proposals, TBL used the Global Trade Analysis Project (GTAP) model, a computable general equilibrium (CGE) model that is a mainstay of international trade analysis.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 70,
    "start_pos": 15220,
    "end_pos": 15564,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "GTAP allowed TBL to model both how both US importsthe tariff basewould shift in response to different tariff regimes, and how this mix would affect the effective (weighted average) tariff rate.15Using these results for each scenario as well as the Congressional Budget Offices June 2024 10-year fiscal and economic projections, TBL constructed revenue estimates for each scenario.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 71,
    "start_pos": 15600,
    "end_pos": 15981,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL offset tariff revenue by 23, in line with the conventional CBO assumption for indirect tax offsets.16 Key to calculating price effects is ascertaining the import share of PCE, which is not straightforward since imports are not directly accounted for in PCE. Imports make up about a quarter of goods consumption alone. Knowing this and the fact that goods consumption is about a third of overall PCE allows for a broad tariff to be mapped to PCE prices.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 72,
    "start_pos": 15861,
    "end_pos": 16318,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "For tariffs that differ by country, additional information on commodity import shares is needed. In 2023 for example, China accounted for 14 of goods imports into the US, Canada 12, and Mexico 15. These 2023 import shares are sufficient for calculating the pre-substitution statistics; for the post-substitution statistics, TBL updated each share using incremental information from the GTAP simulation.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 73,
    "start_pos": 15957,
    "end_pos": 16360,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBL assumes consistent with the economic literature that tariff passthrough to consumer prices is 100; we also assume that the unilateral scenarios had a partial exchange rate effect mitigating the price impactthe dollar strengthens under tariffs without retaliation and so imports are otherwise cheaper to consumersand that domestic producers of substitutes for tariffed goods take advantage of the tariffs and raise their prices as well.17 Although some imports are consumed directly by final purchasers (households, businesses, and governments), strictly speaking, a tariff at once has a broader and a narrower base than a conventional consumption or a sales tax.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 74,
    "start_pos": 16623,
    "end_pos": 17290,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The tariff base is broader in the sense that some imports are final purchases for the purposes of investment, not consumption (think of an imported bulldozer or piece of business software), while many others are not final purchases at all but rather intermediate inputs into the domestic production process (say, an imported auto part for an American car). Tariffs therefore affect both consumption and investment as well as input costs.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 75,
    "start_pos": 16979,
    "end_pos": 17417,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Within consumption, tariffs have a narrower base than most sales taxes or value-added taxes (VATs) in that consumer spending on imports, even when expanded in scope to include both imported finished goods and the imported content of domestically-produced goods and services, is only about 10 of all personal consumption expenditures and a quarter of goods spending.18So even within consumption, tariffs only directly apply to a small portion.19 For a review of the incidence literature, seeClausing  Lovely (2024).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 76,
    "start_pos": 17493,
    "end_pos": 18008,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "For a list of current FTA signatories, seehere. Near-immediate retaliation is often the experience in trade conflicts. In 2018 for example, China responded within days to US Section 301 tariffs withtheir own retaliatory tariffs. Retaliation strategy is a source of uncertainty. When retaliating against a narrow, targeted tariff, a country will likely be thoughtful in the goods it counter-targets, rather than always responding tit-for-tat against the same goods at the same rate.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 77,
    "start_pos": 17540,
    "end_pos": 18022,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Against a broad tariff on all imported goods, however, tit-for-tat seemed like a reasonable, neutral assumption. Throughout the piece, TBL uses effective synonymously with weighted-average. The overall effective tariff rate is defined as tariff revenue divided by total goods imports. Other TBL assumptions would further modify this illustrative score. TBL assumes that GTAP outcomes take roughly 3 years to fully phase-in.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 78,
    "start_pos": 17652,
    "end_pos": 18076,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "For this illustrative proposal implemented in 2023, that means the 2023 gross revenue would be higher than 300 billion, since the full trade substitution effects would only be partially incorporated in 2023. In calculating net revenue, TBL also assumes a 23 indirect tax offset, consistent with standard CBO assumptions. This scenario is closest to the ones modeled byTax Policy Center (2024)andClausing  Lovely (2024), each of which estimated 2.8 trillion in revenue over 10 years.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 79,
    "start_pos": 17859,
    "end_pos": 18342,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Note that the latter paper estimates revenue over the 2026-2035 period rather than 2025-2034 as in TBLs analysis and Tax Policy Centers. See e.g.Amiti et al (2019). TBL assumes, as in the conventional assumptions, that real GDP effects phase-in over 3 years. For comparison, arecent Goldman Sachs research notefound a reduction in real GDP level of 0.03pp per 1pp of additional effective tariff rate.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 80,
    "start_pos": 17995,
    "end_pos": 18396,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "TBLs results imply the exact same marginal effect per 1pp of pre-substitution effective tariff and a slightly higher marginal effect of 0.04pp per 1pp of post-substitution effective tariff. For an intertemporal dynamic simulation of tariff impacts using a different model, G-Cubed, seeMcKibbin et al (2024).",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 81,
    "start_pos": 18184,
    "end_pos": 18492,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "This exercise takes the equilibriummedium-to-long-run pre-substitution price effects and applies them to 2023 nominal average disposable income per household, which came to 157,652 using data on income from BEA and household counts from CBO. If tariff revenue were used to fund revenue reductions in other sources, these shares would be higher. Indeed, President Trump at one point in the 2024 campaign suggested using tariff revenue as a way of eliminating the individual income tax. SeeCBO 2022.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 82,
    "start_pos": 18425,
    "end_pos": 18923,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "SeeCBO 2022. CBO still accounts for this wedge even under conventional assumptions. Retaliatory tariffs and lower rest-of-world income also means the market for USexportsis significantly smaller, which reduces US exporter income and thus related tax revenue. That exporter channel however is beyond the scope of TBLs relaxed conventional approach. TBL used the Standard GTAP Model v7 with v11A of the GTAP Database.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 83,
    "start_pos": 18495,
    "end_pos": 18910,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "In each model run, the shocks were calibrated to be 10 (or in the case of China, 60, and for Mexico, 200) add-on tariffs to all goods imports; services were excluded from the shocks. Retaliation scenarios assumed that each country levied a tit-for-tat equivalent tariff on all imports from the US on exactly the same goods and at the same rates as the US tariff on that countrys exports. TBL assumed GTAP equilibrium effects on imports phase-in over three years.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 84,
    "start_pos": 18677,
    "end_pos": 19140,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Each GTAP model run solved with standard closure. To account for this, TBL expands their first stage PCE effect calculation by 15 to arrive at the final estimate. TBL used GTAP and FRBUS to calibrate the offsetting exchange rate effect for the scenarios without retaliation. Budget Lab calculations for 2023 usingBEA Input-Output tables.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 85,
    "start_pos": 18726,
    "end_pos": 19064,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "Tariffs can indirectly affect a broader share of consumer spending, for example if domestic firms that produce substitutes for tariffed goods raise their prices to take advantage of the markup space created by the tariff.",
    "source_url": "https://budgetlab.yale.edu/research/fiscal-macroeconomic-and-price-estimates-tariffs-under-both-non-retaliation-and-retaliation",
    "chunk_id": 86,
    "start_pos": 18947,
    "end_pos": 19169,
    "document_id": "Fiscal, Macroeconomic, and Price Estimates of Tariffs Under Both Non-Retaliation and Retaliation Scenarios | The Budget Lab at Yale"
  },
  {
    "content": "The Impact of Trump-Era Tariffs on Corporate ESG Activities NewsUSUpdated: April 8 2025 ArticleSummary Introduction The Trump administrations aggressive tariff strategy, revived again in the 2024 campaign and partially reinstated in early 2025, has not only disrupted global trade flows but also reshaped the landscape of Environmental, Social, and Governance (ESG) strategies for multinational corporations.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 408,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Aimed at promoting economic independence and countering trade deficits, these tariffssome reaching as high as 49have catalyzed unintended consequences that ripple through corporate sustainability programs and ESG investment frameworks. In this article, we explore how the Trump-era tariffs are influencing ESG activities, drawing from recent macroeconomic data, global case studies, and investment trends to provide a forward-looking analysis.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 1,
    "start_pos": 235,
    "end_pos": 679,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Supply Chain Shocks and Environmental Trade-Offs The reintroduction and expansion of tariffs have prompted companies to reroute their global supply chains away from traditional hubs like China. While these moves are designed to sidestep punitive import duties, they often lead to increased carbon footprints due to longer transportation routes and less efficient manufacturing standards in the new host countries.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 2,
    "start_pos": 428,
    "end_pos": 842,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "According to April 2025 data, the U.S. has implemented a baseline 10 tariff on nearly all imports, with significantly higher rates on specific countries: Shifting production from China to Vietnam or Cambodia, for example, exposes companies to weaker environmental regulations. The environmental policy stringency index published by the OECD shows lower scores for these alternative nations, which translates to less control over carbon emissions and hazardous waste management.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 3,
    "start_pos": 704,
    "end_pos": 1182,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Furthermore, greenhouse gas emissions per unit of output tend to be higher, complicating ESG reporting for companies under scrutiny from investors and regulators. A real-world example is seen in the electronics sector. Apple, in response to tariffs, diversified its production base from China to Vietnam and India. However, its 2024 ESG report noted a temporary increase in Scope 3 emissions attributed to transportation and facility upgrades in these countries.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 4,
    "start_pos": 866,
    "end_pos": 1329,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "This presents a clear case of how tariff-induced reshuffling can temporarily reverse environmental progress. Another notable case involves Tesla, which had planned to use a localized supply network in China for its Asian EV models. Due to high U.S. tariffs, Tesla announced in Q1 2025 a shift of some battery sourcing to South Korea and Indonesiaregions where mining-related emissions and labor compliance concerns are more pronounced. This pivot may complicate Teslas carbon-neutral goals for 2030.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 5,
    "start_pos": 974,
    "end_pos": 1474,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Social Risks in New Manufacturing Frontiers The social dimension of ESG also faces pressure under this new tariff regime. Moving supply chains to lower-tariff countries often means engaging with labor markets that have weaker protections, lower wages, and a higher risk of human rights violations. These shifts expose companies to reputational risks, particularly when incidents of labor exploitation come to light.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 6,
    "start_pos": 1095,
    "end_pos": 1511,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "For example, a 2023 investigation found that several garment factories in northern Vietnambenefiting from diverted orders post-tariffslacked proper fire exits and paid below legal minimum wages. Brands sourcing from these facilities faced immediate backlash from consumers and ESG ratings agencies. To visualize the ESG trade-offs: Domestically, while the tariffs were intended to reshore jobs, the net effect has been ambiguous.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 7,
    "start_pos": 1289,
    "end_pos": 1719,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Sectors like U.S. steel did see modest gains, but downstream manufacturers, which rely on affordable imports, suffered cost hikes that led to layoffs. The Peterson Institute estimated a net loss of 300,000 jobs between 2018 and 2020 due to retaliatory tariffs and supply chain instabilityundermining the social promise of protectionism.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 8,
    "start_pos": 1439,
    "end_pos": 1776,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Moreover, U.S. companies with sustainability-linked KPIs often saw disruptions in workforce diversity and safety initiatives when operations were scaled back due to rising costs. This paradoxically led to lower ESG ratings for firms meant to benefit from nationalist trade policy.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 9,
    "start_pos": 1617,
    "end_pos": 1898,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Governance Pressure and Strategic ESG Realignment The unpredictable nature of tariff policies has underscored the need for robust governance systems that can integrate ESG considerations into real-time strategic decisions. However, a KPMG study in 2024 revealed that only 37 of large firms had formal mechanisms to assess trade policy risks within their ESG frameworks. Firms that reacted swiftly and transparently maintained higher ESG ratings.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 10,
    "start_pos": 1839,
    "end_pos": 2285,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "HP Inc., for example, responded to tariff shifts by immediately auditing new suppliers in Southeast Asia using blockchain traceability. This not only ensured compliance with ESG standards but also bolstered investor confidence during a volatile period. On the other hand, some firms attempted to circumvent tariffs through controversial means, such as mislabeling country-of-origin or using shell companies.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 11,
    "start_pos": 1974,
    "end_pos": 2382,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "These tactics, while legally ambiguous, raised red flags about corporate governance and undermined long-term ESG credibility. To counteract these risks, forward-looking companies are revising their procurement policies to include ESG risk scoring that accounts for both tariff exposure and ethical practices. Integration of geopolitical intelligence with ESG data analytics is emerging as a key trend among industry leaders.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 12,
    "start_pos": 2099,
    "end_pos": 2524,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "ESG-inclusive trade risk modeling: 38 Blockchain supplier verification: 42 Country-of-origin compliance: 56 These practices are now being incorporated into ESG audit protocols and annual sustainability reporting standards. ESG Investing in the Tariff Era Despite the headwinds, the ESG investment landscape remains resilient.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 13,
    "start_pos": 2321,
    "end_pos": 2647,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Institutional investors continue to demand transparency and sustainability, with ESG-linked loans (SLLs) and green bonds increasingly incorporating clauses related to geopolitical risk management. The number of SLLs surged from 122 billion in 2019 to over 340 billion in 2024. Investors are also asking tougher questions about how companies adapt to tariffs while upholding ESG standards.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 14,
    "start_pos": 2517,
    "end_pos": 2906,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "BlackRock and Vanguard have issued new stewardship guidelines that require portfolio companies to disclose ESG risks related to trade disruptions. This dynamic is fostering a new era of ESG investingone that not only evaluates carbon footprints or board diversity but also how firms navigate geopolitical uncertainty without compromising values. Companies that demonstrate resilience in ESG performance under tariff-induced stress are likely to enjoy a valuation premium and greater capital access.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 15,
    "start_pos": 2663,
    "end_pos": 3162,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "A growing number of ESG rating agencies have also introduced metrics on trade adaptability, tariff risk exposure, and the ethical composition of shifted supply chains. This reflects a broader market shift from static ESG evaluations to dynamic, context-sensitive assessments. Future Outlook The Trump-era tariff policies, both in their original incarnation and recent revival, have reshaped how corporations think about sustainability.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 16,
    "start_pos": 2830,
    "end_pos": 3266,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "While these tariffs were meant to protect domestic industry, they have introduced significant challenges to maintaining robust ESG performance. Going forward, we can expect a new equilibrium where ESG strategies are more closely tied to geopolitical intelligence. Companies will increasingly invest in adaptive supply chains, predictive analytics, and compliance mechanisms to buffer against future trade shocks.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 17,
    "start_pos": 2973,
    "end_pos": 3386,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "ESG reporting will also evolve to reflect these multidimensional risks, moving beyond carbon metrics to include social and governance indicators that capture the full spectrum of tariff impacts. Geopolitical scenario planning: High ESG-integrated procurement models: Moderate Relocation with ESG safeguards: Low to Moderate In conclusion, tariffs are no longer just trade instrumentsthey are ESG variables.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 18,
    "start_pos": 3167,
    "end_pos": 3574,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "For companies committed to long-term sustainability and ethical governance, adapting to this new reality is not optional; it is essential. Firms that succeed will be those that approach ESG as a cross-functional, risk-aware strategynot just a compliance checklist. By aligning ESG goals with geopolitical foresight, companies can not only maintain their commitments amid uncertainty but also seize competitive advantage in a world where both sustainability and resilience are paramount.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 19,
    "start_pos": 3305,
    "end_pos": 3792,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "Why Work with ASUENE Inc.? ASUENE USA Inc., a subsidiary of Asuene Inc., is a key player in carbon accounting, offering a comprehensive platform that measures, reduces, and reports emissions, including Scope 1-3, with expertise in decarbonization. Asuene serves over 10,000 clients worldwide, providing an all-in-one solution that integrates GHG accounting, ESG supply chain management, a Carbon Credit exchange platform, and third-party verification.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 20,
    "start_pos": 3331,
    "end_pos": 3783,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "ASUENE supports companies in achieving net-zero goals through advanced technology, consulting services, and an extensive network.",
    "source_url": "https://asuene.com/us/blog/the-impact-of-trump-era-tariffs-on-corporate-esg-activities",
    "chunk_id": 21,
    "start_pos": 3460,
    "end_pos": 3590,
    "document_id": "The Impact of Trump-Era Tariffs on Corporate ESG Activities | Blog | ASUENE | The enterprise climate cloud platform | Carbon Calculation Decarbonizated SaaS"
  },
  {
    "content": "html Google Tag Manager for WordPress by gtm4wp.com End Google Tag Manager for WordPress by gtm4wp.com This site is optimized with the Yoast SEO Premium plugin v22.8 (Yoast SEO v25.3.1) - https:yoast.comwordpresspluginsseo How Trumps liberation day tariffs will transform global trade - Atlantic Council  Yoast SEO Premium plugin.",
    "source_url": "https://www.atlanticcouncil.org/content-series/fastthinking/how-trumps-liberation-day-tariffs-will-transform-global-trade/",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 330,
    "document_id": "How Trumps liberation day tariffs will transform global trade - Atlantic Council"
  },
  {
    "content": "Google Tag Manager for WordPress by gtm4wp.com GTM Container placement set to automatic End Google Tag Manager for WordPress by gtm4wp.com YouTube Feeds CSS pluginobject-cache-pro clientphpredis metrichits15066 metricmisses23 metrichit-ratio99.9 metricbytes4733796 metricprefetches8 metricstore-reads219 metricstore-writes23 metricstore-hits655 metricstore-misses17 metricsql-queries32 metricms-total976.95 metricms-cache238.34 metricms-cache-avg0.9890 metricms-cache-ratio24.4",
    "source_url": "https://www.atlanticcouncil.org/content-series/fastthinking/how-trumps-liberation-day-tariffs-will-transform-global-trade/",
    "chunk_id": 1,
    "start_pos": 477,
    "end_pos": 955,
    "document_id": "How Trumps liberation day tariffs will transform global trade - Atlantic Council"
  }
]