[
  {
    "content": "LATEST MARKET UPDATES Dow Jones Futures: Stocks Hold Up, But Growth Ails; Trump Sets 30 EU, Mexico TariffsDow Jones futures will open Sunday evening, along with SP 500 futures and Nasdaq futures.",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 195,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "President Donald Trump announced Saturday that hell impose 30 tariffs on the European Union and Mexico, part...Read More Stock Market Today: Stocks Finish In The Red; Dow Jones Index Bears The Brunt Of SellingThe major indexes closed the day with losses Friday, spurred on by President Donald Trumps announcement of a 35 tariff on Canadian imports.",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 1,
    "start_pos": 348,
    "end_pos": 697,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "The Dow Jones Industrial Average was the hardest hit...Read More Dow Jones Futures Fall As Trump Sets 35 Canada Tariff, Eyes Higher Global RateDow Jones futures fell early Friday, along with SP 500 futures and Nasdaq futures, as President Donald Trump announced a 35 tariff on Canadian goods and floated a higher global baseline.",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 2,
    "start_pos": 677,
    "end_pos": 1007,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "On...Read More View Prior Stock Market Today Updates Current Recommended Market Exposure Level STOCK MARKET TODAY With regular updates throughout each trading session, the Stock Market Today column highlights the latest stock market news and alerts you to any changes in market trend. Youll also get ongoing analysis of thebest stocks to buy and watch. Why is the stock market up today? Why is the market down? Whats the outlook for stock futures? What are thebest stocks to buyright now?",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 3,
    "start_pos": 961,
    "end_pos": 1450,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "Is it time tosell your stocks? Stock Market Today helps you answer those questions before the market opens, throughout each trading session and after each days stock market close. Its a quick and easy way to stay on top of key stock market news and trends as they happen, and see movements in both large caps and small caps that are affecting your own portfolio.",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 4,
    "start_pos": 991,
    "end_pos": 1354,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "Youll find the latest prices and price changes for the Nasdaq, SP 500 and the Dow Jones Industrial Average, as well as for the Russell 2000. Track Stock Futures For The Dow Jones, SP 500 And Nasdaq Stock Market News And Analysis The analysis youll find in the Stock Market Today is based on over 130 years of market history and a detailed study of every top-performing stock since the 1880s.",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 5,
    "start_pos": 1131,
    "end_pos": 1523,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "By tracking the currentrecommended market exposure level, the Stock Market Today helps you stay on top of the latest stock market news while keeping any latest fluctuations in perspective to help you decide what action, if any, to take. Bookmark this page to make sure you stay on top of all the latest action and stock market news, and be sure tocheck The Big Pictureafter each market close for more detailed analysis and stocks to watch.",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 6,
    "start_pos": 1367,
    "end_pos": 1807,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "How To Handle Changing Stock Market Trends YOU MAY ALSO LIKE: Looking For The Best Stocks To Buy And Watch? Start With This 3-Step Routine See Which Stocks Were Just Added To  And Removed From  IBD Stock Lists How To Buy StocksBuying Checklist When To Sell StocksSelling Checklist",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 7,
    "start_pos": 1474,
    "end_pos": 1755,
    "document_id": "Stock Market Today: Stock Market News And Analysis"
  },
  {
    "content": "Frank Lee Jul 11, 2025",
    "source_url": "https://www.morningstar.com/topics/stock-market-trends",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 22,
    "document_id": "Stock Market Trends | Morningstar"
  },
  {
    "content": "Access to this page has been denied because we believe you are using automation tools to browse the website. This may happen as a result of the following: Javascript is disabled or blocked by an extension (ad blockers for example) Your browser does not support cookies Please make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading. Reference ID: 48b04283-5f3b-11f0-b304-5f034a55c3a0",
    "source_url": "https://research.investors.com/markettrend.aspx",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 441,
    "document_id": "Access to this page has been denied."
  }
]