[
  {
    "content": "Access to this page has been denied because we believe you are using automation tools to browse the website. This may happen as a result of the following: Javascript is disabled or blocked by an extension (ad blockers for example) Your browser does not support cookies Please make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading. Reference ID: 4344e3e5-5ae6-11f0-b7bc-202bfcfc5116",
    "source_url": "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 441,
    "document_id": "Access to this page has been denied."
  },
  {
    "content": "Your browser is outdated Update your browser to view ScienceDirect correctly. Check supported browsers Your technical details and browser version: Request ID: 95b468d71dce8f9c-IAD IP: 73.123.93.202 UTC time: 2025-07-07T03:56:0000:00 Browser: Mozilla5.0 (Windows NT 10.0; Win64; x64) AppleWebKit537.36 (KHTML, like Gecko) Chrome91.0.4472.124 Safari537.36",
    "source_url": "https://www.sciencedirect.com/science/article/abs/pii/S0304405X11000730",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 353,
    "document_id": "Page restricted | ScienceDirect"
  },
  {
    "content": "Weekly market wrap Published July 3, 2025Published July 3, 2025 Brock Weimer Share: Share on LinkedIn Share on Facebook Midyear outlook: Three themes for the second half Key takeaways: Despite volatility, stock markets finished the first half at all-time highs, while the SP 500 and Nasdaq are both higher by over 6 year-to-date. Policy uncertainty could resurface in the near term as we approach the July 9 expiration of the 90-day tariff pause.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 0,
    "start_pos": 0,
    "end_pos": 446,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "However, we believe the fundamental backdrop remains supportive in equity markets. The Fed easing cycle is likely to resume this fall, but deficit concerns could keep Treasury yields rangebound in the second half. We see value in the seven- to 10-year maturity space for U.S. investment-grade bonds.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 1,
    "start_pos": 82,
    "end_pos": 382,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "The first half of 2025 provided plenty of twist and turns for investors, with policy shifts driving a near-20 decline in the SP 500, before de-escalating trade tensions, along with resilient economic data, propelled the SP 500 to a new all-time high before the end of June.1With the second half of the year likely to bring its own share of uncertainties, we highlight three key themes and corresponding portfolio opportunities to help investors navigate the second half. 1.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 2,
    "start_pos": 552,
    "end_pos": 1026,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "1. Slower growth, same direction The first half of 2025 was marked by policy uncertainty, as the U.S. announced sweeping tariffs in early April that threatened to raise the effective tariff rate from 2.3 at the end of 2024 to over 25, fueling recession concerns.2A subsequent easing of trade tensions has left the effective tariff rate at approximately 15, with the potential for further declines depending on the outcome of ongoing trade negotiations ahead of next weeks expiration of the 90-day tariff pause on July 9.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 3,
    "start_pos": 1069,
    "end_pos": 1589,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Encouragingly last week, the U.S. reached an agreement with Vietnam, reducing the tariff rate to 20 (40 on goods that are shipped but that dont originate from Vietnam), down from the 46 announced in early April, fitting with the recent trend of de-escalation.3 Although tariff rates have declined from their peak levels, they remain a central focus of the U.S. administrations agenda and are poised to rise significantly compared with previous years.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 4,
    "start_pos": 1519,
    "end_pos": 1970,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "While inflation has been contained thus far, we expect the impact of tariffs to surface in the form of higher prices during the second half, as companies draw down inventories and likely pass on part of the cost to consumers. This could erode household purchasing power and put downward pressure on corporate profit margins, potentially weighing on economic activity in the second half.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 5,
    "start_pos": 1744,
    "end_pos": 2131,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "The upshot, in our view, is that economic data has proven resilient, supported by a healthy, albeit easing, labor market.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 6,
    "start_pos": 1865,
    "end_pos": 1987,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "This resilience was on display in last weeks jobs data, with nonfarm payrolls rising by 147,000 in June, above expectations for a 118,000 gain.1Additionally, the unemployment rate fell to 4.1, while initial jobless claims fell to a six-week low of 233,000.1 Chart description This chart shows that while nonfarm payroll growth has moderated compared to the average pace of gains in 2023 and 2024, it has remained positive in 2025.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 7,
    "start_pos": 2295,
    "end_pos": 2726,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Additionally, the proposed One Big Beautiful Bill (OBBA) legislation aims to extend the 2017 tax cuts and introduce new tax breaks for tips, overtime pay, and seniors, among others.6For these reasons, while economic growth may slow in the near term, we could see a potential re-acceleration of growth in 2026. The prospect of moderate fiscal stimulus and easing monetary policy should be supportive of economic and earnings growth, in our view.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 8,
    "start_pos": 2604,
    "end_pos": 3049,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Portfolio opportunity While U.S. economic growth is slowing, we dont expect it to stall. In our view, this environment is likely to favor stocks more than bonds, and we recommend investors overweight U.S. large-cap and mid-cap stocks, offset with an underweight to international bonds and U.S. high-yield bonds.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 9,
    "start_pos": 2692,
    "end_pos": 3004,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "S. high-yield bonds. At a sector level, we recommend investors maintain balanced exposure across defensive, cyclical and growth sectors, driven by our expectation for an ongoing broadening of leadership in 2025. We recommend investors overweight financials, health care and consumer discretionary, offset with underweights to consumer staples and materials. 2.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 10,
    "start_pos": 2882,
    "end_pos": 3242,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "2. U.S. stocks play catch-up versus international Since 2010, U.S. economic growth has outpaced most developed markets, contributing to U.S. equity outperformance versus international in 12 of the past 15 years.4However, this trend reversed in the first half of 2025, with international stocksparticularly in Europeleading gains. Expansionary fiscal policy in Germany and deeper rate cuts by the European Central Bank have helped boost European equities and lift regional growth expectations.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 11,
    "start_pos": 3208,
    "end_pos": 3700,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "In contrast, U.S. policy shifts are expected to moderate growth in the near term, narrowing the U.S. advantage. Despite a narrowing gap in economic growth, U.S. corporate profits are expected to continue outpacing those of international peers. We anticipate stronger U.S. profit growth ahead, likely bolstered by AI tailwinds and a more accommodative policy environment.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 12,
    "start_pos": 3319,
    "end_pos": 3690,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "In contrast, tariffs could weigh on demand for overseas goods, perhaps creating a less supportive backdrop for international earnings. This chart shows that the gap in real GDP growth for the U.S. versus the eurozone, United Kingdom, and Japan is expected to narrow in 2025. However, forward earnings growth estimates remain stronger for U.S. equities. An index is unmanaged, cannot be invested into directly and is not meant to depict an actual investment.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 13,
    "start_pos": 3453,
    "end_pos": 3911,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Past performance does not guarantee future results. A sharply weaker U.S. dollar was another key driver of international outperformance in the first half, with the DXY index falling over 101amid slowing U.S. growth and concerns about the dollars global dominance. However, we believe the dollar could find some support in the near term. U.S. bond yields remain higher than those in most developed markets, particularly Japan and many eurozone countries.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 14,
    "start_pos": 3504,
    "end_pos": 3958,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Additionally, we dont see a viable alternative to the dollar in the near term, and we believe it will retain its role as global reserve currency. Over the long term, however, the dollar may soften after a 15-year uptrend, reinforcing the importance of global diversification. This chart shows that in USD terms, developed international large-cap stocks gained 19.5 year-to-date, developed international SMID stocks gained 21.5 and emerging-market stocks gained 16.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 15,
    "start_pos": 3649,
    "end_pos": 4114,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "In local currency terms, developed international large-cap stocks gained 7.8, developed international SMID stocks gained 10.4 and emerging-market stocks gained 11.4. Past performance does not guarantee future results. An index is unmanaged, cannot be invested into directly and is not meant to depict an actual investment.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 16,
    "start_pos": 3814,
    "end_pos": 4137,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "The strong performance from international stocks in the first half highlights the importance of maintaining strategic allocations to international investments as part of a well-diversified portfolio. In the near term, however, we believe the greater opportunity lies in U.S. markets versus international, and we recommend investors slightly underweight international developed large-cap stocks in favor of U.S. large-cap and mid-cap stocks.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 17,
    "start_pos": 4013,
    "end_pos": 4454,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "In our view, much of the good news behind international markets is reflected in current prices, and ongoing strength in corporate earnings could help provide support to U.S. equities. Additionally, the potential for the U.S. dollar to find support in the near term could provide less of a boost to international returns. 3. Yields remain rangebound as the Fed resumes rate cuts in the fall We continue to expect 10-year Treasury yields to trade primarily in the 44.5 range.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 18,
    "start_pos": 4196,
    "end_pos": 4670,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "5 range. While the benchmark yield could temporarily move outside this range, we believe there are guardrails on both sides. Despite downside inflation surprises in the first half of the year, the Federal Reserve held its policy rate steady, awaiting greater clarity on the economic and inflationary impact of tariffs. At its June meeting, updated Fed projections showed that the median FOMC member still anticipates two interest-rate cuts in 2025unchanged from the March projections.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 19,
    "start_pos": 4311,
    "end_pos": 4795,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "For 2026, policymakers now expect just one cut (down from two in March), followed by another in 2027, signaling a more cautious easing cycle. In our view, the potential stagflationary effects of tariffshigher inflation coupled with slower growthplace policymakers in a challenging position. However, we expect the Fed to resume rate cuts this fall, potentially putting downward pressure on bond yields.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 20,
    "start_pos": 4452,
    "end_pos": 4855,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "This chart shows that futures markets expect the Fed to cut interest rates twice in the second half, with the first cut in September. A potential offset to lower bond yields driven by Fed easing is the concern over widening fiscal deficits.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 21,
    "start_pos": 4585,
    "end_pos": 4826,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "The proposed tax bill is projected to increase the national debt by 4.1 trillion (including interest) over the next decade.5As a result, federal debt held by the public as a percentage of GDP could rise from around 100 today to 130.5Rising debt levels may prompt investors to demand higher yields to compensate for increased perceived credit risk, particularly at the longer end of the yield curve.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 22,
    "start_pos": 4983,
    "end_pos": 5382,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "We recommend that investors underweight fixed-income investments, particularly international bonds, due to their relatively lower yields, and maintain a modest underweight in U.S. high-yield bonds, where credit spreads remain historically tight, and instead favor U.S. equities. Within U.S. investment-grade bonds, we recommend investors modestly extend duration, with a focus on securities in the seven- to 10-year maturity range.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 23,
    "start_pos": 5261,
    "end_pos": 5693,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "In our view, bonds in this segment may allow investors to lock in higher yields for a longer period compared with shorter-term bonds. Additionally, these bonds may be less exposed to concerns over widening government budget deficits and rising debt levels versus longer-term bonds, e.g. 30-year bonds.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 24,
    "start_pos": 5394,
    "end_pos": 5696,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "g. 30-year bonds. Staying on track in the second half While uncertainty remains, resilient economic data, easing trade tensions, and potential policy supportboth monetary and fiscal offer reasons for cautious optimism. Investors may benefit from staying diversified across growth and value sectors while tilting portfolios toward U.S. equities. Within U.S. investment-grade bonds, we see value in modestly extending duration with a focus on the seven- to 10-year maturity range.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 25,
    "start_pos": 5594,
    "end_pos": 6072,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "As conditions evolve, maintaining a well-diversified portfolio with opportunistic tilts can help investors take advantage of opportunities and market volatility, while staying on track for their financial goals. Brock Weimer, CFAInvestment Strategy Sources:1. FactSet2. Yale Budget Lab3. WhiteHouse.gov4. FactSet, International stocks represented by MSCI ACWI ex. U.S. Index.5. Committee for a Responsible Federal Budget and Congressional Budget Office.6.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 26,
    "start_pos": 5805,
    "end_pos": 6261,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "6. Tax Foundation Weekly market stats Weekly market statsINDEXCLOSEWEEKYTDDow Jones Industrial Average44,8292.35.4SP 500 Index6,2791.76.8NASDAQ20,6011.66.7MSCI EAFE 2,6560.117.410-yr Treasury Yield4.350.10.5Oil (bbl)67.022.3-6.6Bonds98.47-0.33.8 Source: FactSet, 732025. Bonds represented by the iShares Core U.S. Aggregate Bond ETF. Past performance does not guarantee future results. 4-day performance ending on Thursday.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 27,
    "start_pos": 6072,
    "end_pos": 6495,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "The week ahead Important economic releases this week include the NFIB small business index and consumer credit data. Review last weeks weekly market update. Brock Weimer is responsible for analyzing economic data, assessing market trends, and supporting the development of resources that help clients work toward their long-term financial goals. Brock graduated from Southern Illinois University Edwardsville with a bachelors degree in economics and finance.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 28,
    "start_pos": 6188,
    "end_pos": 6647,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "He is a CFA charter holder and member of the CFA Institute and CFA Society of St. Louis. Important Information: The Weekly Market Update is published every Friday, after market close. This is for informational purposes only and should not be interpreted as specific investment advice. Investors should make investment decisions based on their unique investment objectives and financial situation.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 29,
    "start_pos": 6276,
    "end_pos": 6673,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "While the information is believed to be accurate, it is not guaranteed and is subject to change without notice. Investors should understand the risks involved in owning investments, including interest rate risk, credit risk and market risk. The value of investments fluctuates and investors can lose some or all of their principal. Market indexes are unmanaged and cannot be invested into directly and are not meant to depict an actual investment.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 30,
    "start_pos": 6387,
    "end_pos": 6835,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Diversification does not guarantee a profit or protect against loss in declining markets. Systematic investing does not guarantee a profit or protect against loss. Investors should consider their willingness to keep investing when share prices are declining. Dividends may be increased, decreased or eliminated at any time without notice.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 31,
    "start_pos": 6476,
    "end_pos": 6815,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  },
  {
    "content": "Special risks are inherent in international investing, including those related to currency fluctuations and foreign political and economic events.Before investing in bonds, you should understand the risks involved, including credit risk and market risk. Bond investments are also subject to interest rate risk such that when interest rates rise, the prices of bonds can decrease, and the investor can lose principal value if the investment is sold prior to maturity.",
    "source_url": "https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/stock-market-weekly-update",
    "chunk_id": 32,
    "start_pos": 6729,
    "end_pos": 7196,
    "document_id": "Weekly Stock Market Update | Edward Jones"
  }
]